<a href="https://colab.research.google.com/github/kvinne-anc/Data-Science-Notebooks/blob/main/Cleaning_Data_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

---
# Lambda School Data Science - Intro to Pandas
---
# 05 - Cleaning Data
---

##STOP! BEFORE GOING ANY FURTHER...  


1. Click "File" at the top.
2. Then, "Save a Copy in Drive."
3. Change the file name to "FIRSTNAME_LASTNAME_1_2"  

Now you have a copy of this notebook in your Drive account. This is the copy you'll edit and submit. Be sure to do this for ***every*** assignment!

### Import pandas

In [ ]:
import pandas as pd

### Import the data in the CSV file
You can find the data [here](https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy2.csv). Should have a shape of (222,3). Use this [resource](https://www.iban.com/country-codes) to clean values correctly.

In [ ]:
nook = pd.read_csv('https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy2.csv')
nook

     Unnamed: 0             countrys     GDP code
0             0          Afghanistan   21.71  AFG
1             1              Albania   13.40  ALB
2             2              Algeria  227.80  DZA
3             3       American Samoa    0.75  ASM
4             4              Andorra    4.80  AND
..          ...                  ...     ...  ...
217         217  U.S. Virgin Islands    5.08  VIR
218         218            West Bank    6.64  WBG
219         219                Yemen   45.45  YEM
220         220               Zambia   25.61  ZMB
221         221             Zimbabwe   13.74  ZMB

[222 rows x 4 columns]

In [ ]:
nook.shape

(222, 4)

In [ ]:
nook = nook.drop(nook.columns[0], axis=1)
nook

                countrys     GDP code
0            Afghanistan   21.71  AFG
1                Albania   13.40  ALB
2                Algeria  227.80  DZA
3         American Samoa    0.75  ASM
4                Andorra    4.80  AND
..                   ...     ...  ...
217  U.S. Virgin Islands    5.08  VIR
218            West Bank    6.64  WBG
219                Yemen   45.45  YEM
220               Zambia   25.61  ZMB
221             Zimbabwe   13.74  ZMB

[222 rows x 3 columns]

### Quickly inspect the head

In [ ]:
nook.head()

         countrys     GDP code
0     Afghanistan   21.71  AFG
1         Albania   13.40  ALB
2         Algeria  227.80  DZA
3  American Samoa    0.75  ASM
4         Andorra    4.80  AND

### Inspect the tail

In [ ]:
nook.tail()

                countrys    GDP code
217  U.S. Virgin Islands   5.08  VIR
218            West Bank   6.64  WBG
219                Yemen  45.45  YEM
220               Zambia  25.61  ZMB
221             Zimbabwe  13.74  ZMB

### What is the shape of the DataFrame? Does it correspond to what we expected?

In [ ]:
nook.shape

(222, 3)

# yes, it does!

### Do you need to change the index?

In [ ]:
# maybe? no, it doesn't look like it ... I will change the headers ...

In [ ]:
nook.columns = ["COUNTRIES", "GDP", "CODE"]  
nook

               COUNTRIES     GDP CODE
0            Afghanistan   21.71  AFG
1                Albania   13.40  ALB
2                Algeria  227.80  DZA
3         American Samoa    0.75  ASM
4                Andorra    4.80  AND
..                   ...     ...  ...
217  U.S. Virgin Islands    5.08  VIR
218            West Bank    6.64  WBG
219                Yemen   45.45  YEM
220               Zambia   25.61  ZMB
221             Zimbabwe   13.74  ZMB

[222 rows x 3 columns]

### Missing values?
Find all the missing values and correct them.

In [ ]:
nook.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222 entries, 0 to 221
Data columns (total 3 columns):
COUNTRIES    218 non-null object
GDP          219 non-null float64
CODE         217 non-null object
dtypes: float64(1), object(2)
memory usage: 5.3+ KB

In [ ]:
nook.isnull().sum()

COUNTRIES    4
GDP          3
CODE         5
dtype: int64

In [ ]:
nook[nook.isnull().any(axis=1)]

        COUNTRIES     GDP CODE
6             NaN    0.18  AIA
14   Bahamas, The    8.65  NaN
16     Bangladesh     NaN  BGD
20            NaN    1.67  BLZ
55        Denmark  347.20  NaN
70         France     NaN  FRA
90        Hungary  129.70  NaN
96        Ireland     NaN  IRL
100       Jamaica   13.92  NaN
106           NaN    0.16  KIR
200          Togo    4.84  NaN
206           NaN    0.04  TUV

In [ ]:
nook.at[6,'COUNTRIES'] = "Anguilla" 
nook.at[14,'CODE'] = "BHS"
nook.at[16,'GDP'] = 286.0
nook.at[20,'COUNTRIES'] = "Belize"
nook.at[55,'CODE'] = "DNK"
nook.at[70,'GDP'] = 2890.0
nook.at[90,'CODE'] = "HUN"
nook.at[96,'GDP'] = 381.3
nook.at[100,'CODE'] = "JAM"
nook.at[106,'COUNTRIES'] = "Kiribati" 
nook.at[200,'CODE'] = "TGO"
nook.at[206,'COUNTRIES'] = "Tuvalu"

In [ ]:
nook.isnull().sum()

COUNTRIES    0
GDP          0
CODE         0
dtype: int64

In [ ]:
nook.head()

        COUNTRIES     GDP CODE
0     Afghanistan   21.71  AFG
1         Albania   13.40  ALB
2         Algeria  227.80  DZA
3  American Samoa    0.75  ASM
4         Andorra    4.80  AND

In [ ]:
nook['COUNTRIES'].value_counts(sort=True).tail()

Paraguay             1
Colombia             1
France               1
Jamaica              1
Equatorial Guinea    1
Name: COUNTRIES, dtype: int64

### Find duplicate values  
Clean where necessary:  
*   France has a GDP of 2902.0 billion.
*   Ireland has a GDP of 245.80 billion.
*   Bangladesh has a GDP of 186.60 billion.

In [ ]:
nook['GDP'].value_counts(sort=True).head()

0.18      3
0.75      2
0.16      2
341.20    1
529.50    1
Name: GDP, dtype: int64

In [ ]:
nook['CODE'].value_counts(sort=True).head()

ZMB    2
ARG    2
CIV    1
ARM    1
ASM    1
Name: CODE, dtype: int64

In [ ]:
nook[nook['CODE'] == "ARG"]

                COUNTRIES    GDP CODE
8               Argentina  536.2  ARG
209  United Arab Emirates  416.4  ARG

In [ ]:
nook.at[209,'CODE'] = "UAE"

In [ ]:
nook[nook['CODE'] == "ZMB"]

    COUNTRIES    GDP CODE
220    Zambia  25.61  ZMB
221  Zimbabwe  13.74  ZMB

In [ ]:
nook.at[221,'CODE'] = "ZWE"

### Verify the change persisted!

In [ ]:
nook['CODE'].value_counts(sort=True).head()

CIV    1
GEO    1
LIE    1
BRN    1
BHR    1
Name: CODE, dtype: int64

### Submit your assignment notebook! (Make sure you've changed the name to FIRSTNAME_LASTNAME_1_2): 

1.  Click the Share button in the upper-right hand corner of the notebook.
2.  Get the shareable link.
3.  Set condition to: "Anyone with the link can comment."
4.  TBD 


---